Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotFaceVisibility_t
The visibility of object faces under the mouse cursor.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotFaceVisibility_t.Visible
Face is visible and opaque.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotFaceVisibility_t.Tranparent
Face is partially transparent.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotFaceVisibility_t.Invisible
Face is invisible.